; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image0 - mode
	thermograph1 - mode
	spectrograph2 - mode
	Star2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	Star14 - direction
	GroundStation1 - direction
	Star11 - direction
	Star8 - direction
	Star12 - direction
	Star0 - direction
	GroundStation4 - direction
	GroundStation13 - direction
	Planet15 - direction
	Planet16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
	Planet20 - direction
	Star21 - direction
	Planet22 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star12)
	(supports instrument2 spectrograph2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument3 image0)
	(supports instrument3 thermograph1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 Star12)
	(supports instrument4 thermograph1)
	(supports instrument4 image0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation13)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star12)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
)
(:goal (and
	(have_image Planet15 image0)
	(have_image Planet16 thermograph1)
	(have_image Planet17 thermograph1)
	(have_image Phenomenon18 spectrograph2)
	(have_image Phenomenon19 thermograph1)
	(have_image Planet20 spectrograph2)
	(have_image Star21 image0)
	(have_image Planet22 spectrograph2)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
2. (calibrate satellite0 instrument1 star12)
   added: (calibrated instrument1)
   goals met: 0 of 8
3. (turn_to satellite0 phenomenon18 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 phenomenon18)
   goals met: 0 of 8
4. (take_image satellite0 phenomenon18 instrument1 spectrograph2)
   added: (have_image phenomenon18 spectrograph2)
   goals met: 1 of 8
5. (turn_to satellite0 phenomenon19 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon19)
   goals met: 1 of 8
6. (take_image satellite0 phenomenon19 instrument1 thermograph1)
   added: (have_image phenomenon19 thermograph1)
   goals met: 2 of 8
7. (turn_to satellite0 planet15 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 planet15)
   goals met: 2 of 8
8. (take_image satellite0 planet15 instrument1 image0)
   added: (have_image planet15 image0)
   goals met: 3 of 8
9. (turn_to satellite0 planet16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet16)
   goals met: 3 of 8
10. (take_image satellite0 planet16 instrument1 thermograph1)
   added: (have_image planet16 thermograph1)
   goals met: 4 of 8
11. (turn_to satellite0 planet17 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet17)
   goals met: 4 of 8
12. (take_image satellite0 planet17 instrument1 thermograph1)
   added: (have_image planet17 thermograph1)
   goals met: 5 of 8
13. (turn_to satellite0 planet20 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet20)
   goals met: 5 of 8
14. (take_image satellite0 planet20 instrument1 spectrograph2)
   added: (have_image planet20 spectrograph2)
   goals met: 6 of 8
15. (turn_to satellite0 planet22 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 planet22)
   goals met: 6 of 8
16. (take_image satellite0 planet22 instrument1 spectrograph2)
   added: (have_image planet22 spectrograph2)
   goals met: 7 of 8
17. (turn_to satellite0 star21 planet22)
   deleted: (pointing satellite0 planet22)
   added: (pointing satellite0 star21)
   goals met: 7 of 8
18. (take_image satellite0 star21 instrument1 image0)
   added: (have_image star21 image0)
   goals met: 8 of 8
